/**
 * 식별자(identifier) : 어떤 값을 구해서 식별할 수 있는 고유한 이름
 * 식별자는 값이 아니라 메모리 주소에 붙여진 이름으로 변수, 함수,클래스 등이 모두 식별자에 속함
 * 변수 이름은 메모리에 존재하는 변수를 식별할 수 있고
 */

/**이름 짓는 법 
 * keyword 못씀
 * camelCase
 * snake_case
 * dash-case, kebab-case
 * "$ _ "특수 문자 중 이름에 들어갈 수 있는 문자들"
*/

/** 변수 선언
 * 1. 메모리 할당 된다
 * 2. 주소가 생성
 * 3. 선언된 변수에 값을 할당
 */
let name="Kim";
/** 변수 선언할 때 3개 키워드가 있다!
 * var: 오래됨 쓰지 마셈!
 * let: 변경이 가능한 변수를 선언할 때
 * const: 변경이 불가능한 변수를 선언할 때
 */
const $spreatics=100;
var _js="Javascript";
/**var: 선언 + 초기화 -> 할당 
 * let: 선언 -> 초기화 -> 할당
 * const: 선언 + 초기화 + 할당
*/

